_drafts/redis.html
---
layout: post
title: Redis
author: zrg
description: Redis是一个开源的使用ANSI C语言编写、支持网络、可基于内存亦可持久化的日志型、Key-Value数据库，并提供多种语言的API。从2010年3月15日起，Redis的开发工作由VMware主持。从2013年5月开始，Redis的开发由Pivotal赞助。
excerpt: 
comments: false
categories: 
- database
tags:
- Redis
---

<p>
感谢您阅读此文，如果您发现任何错误，请发邮件至 zrg1390556487@gmail.com，谢谢！
</p>

<div id="outline-container-orge5c44f1" class="outline-2">
<h2 id="orge5c44f1">配置</h2>
</div>
<div id="outline-container-org30480ce" class="outline-2">
<h2 id="org30480ce">Redis 与 ThinkPHP</h2>
<div class="outline-text-2" id="text-org30480ce">
</div>
<div id="outline-container-org662b8b6" class="outline-3">
<h3 id="org662b8b6">ThinkPHP 3.2.3 使用 Redis</h3>
<div class="outline-text-3" id="text-org662b8b6">
<pre class="example">
框架自带的 Redis 类
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org49c119b">'<span style="color: #AF87FF;">DATA_CACHE_PREFIX</span>' =&gt; '<span style="color: #AF87FF;">Redis_</span>',//&#32531;&#23384;&#21069;&#32512;
'<span style="color: #AF87FF;">DATA_CACHE_TYPE</span>'=&gt;'<span style="color: #AF87FF;">Redis</span>',//&#40664;&#35748;&#21160;&#24577;&#32531;&#23384;&#20026;Redis
'<span style="color: #AF87FF;">REDIS_RW_SEPARATE</span>' =&gt; true, //Redis&#35835;&#20889;&#20998;&#31163; true &#24320;&#21551;
'<span style="color: #AF87FF;">REDIS_HOST</span>'=&gt;'<span style="color: #AF87FF;">192.168.91.102</span>', //redis&#26381;&#21153;&#22120;ip&#65292;&#22810;&#21488;&#29992;&#36887;&#21495;&#38548;&#24320;&#65307;&#35835;&#20889;&#20998;&#31163;&#24320;&#21551;&#26102;&#65292;&#31532;&#19968;&#21488;&#36127;&#36131;&#20889;&#65292;&#20854;&#23427;[&#38543;&#26426;]&#36127;&#36131;&#35835;&#65307;
'<span style="color: #AF87FF;">REDIS_PORT</span>'=&gt;'<span style="color: #AF87FF;">6379</span>',//&#31471;&#21475;&#21495;
'<span style="color: #AF87FF;">REDIS_TIMEOUT</span>'=&gt;'<span style="color: #AF87FF;">300</span>',//&#36229;&#26102;&#26102;&#38388;
'<span style="color: #AF87FF;">REDIS_PERSISTENT</span>'=&gt;false,//&#26159;&#21542;&#38271;&#36830;&#25509; false=&#30701;&#36830;&#25509;
'<span style="color: #AF87FF;">REDIS_AUTH</span>'=&gt;'',//AUTH&#35748;&#35777;&#23494;&#30721;
'<span style="color: #AF87FF;">DATA_CACHE_TIME</span>' =&gt; 7200, //2&#23567;&#26102;&#21518;&#22833;&#25928;
</pre>
</div>
</div>
<div id="outline-container-org31fe9a2" class="outline-4">
<h4 id="org31fe9a2">调用</h4>
<div class="outline-text-4" id="text-org31fe9a2">
<pre class="example">
1. 直接调用框架自带的Redis类，
路径：\ThinkPHP\Library\Think\Cache\Driver\Redis.class.php
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp">//&#21019;&#24314;&#19968;&#20010;redis&#23545;&#35937;
$redis = new \Redis()<span style="color: #8B8878;">;</span>
//&#36830;&#25509;&#26412;&#22320;&#30340; Redis &#26381;&#21153;
$redis-&gt;connect('<span style="color: #AF87FF;">127.0.0.1</span>', 6379)<span style="color: #8B8878;">;</span>
//&#23494;&#30721;&#39564;&#35777;,&#22914;&#26524;&#27809;&#26377;&#21487;&#20197;&#19981;&#35774;&#32622;
$redis-&gt;auth('<span style="color: #AF87FF;">123456</span>')<span style="color: #8B8878;">;</span>
//&#26597;&#30475;&#26381;&#21153;&#26159;&#21542;&#36816;&#34892;
echo <span style="color: #CDC673;">"Server is running: "</span> . $redis-&gt;ping()<span style="color: #8B8878;">;</span>
echo '<span style="color: #AF87FF;">&lt;br/&gt;</span>'<span style="color: #8B8878;">;</span>
//&#35774;&#32622;&#32531;&#23384;
$redis-&gt;set('<span style="color: #AF87FF;">username</span>','zhang san',3600)<span style="color: #8B8878;">;</span>
//&#33719;&#21462;&#32531;&#23384;
$user_name = $redis-&gt;get('<span style="color: #AF87FF;">username</span>')<span style="color: #8B8878;">;</span>
var_dump($user_name)<span style="color: #8B8878;">;</span>
</pre>
</div>

<pre class="example">
2. 使用S方法
S('study','zhangsan');
$name = S('study);
echo $name
</pre>
</div>
</div>
<div id="outline-container-org8802511" class="outline-4">
<h4 id="org8802511">NOAUTH Authentication required</h4>
<div class="outline-text-4" id="text-org8802511">
<p>
描述：调用 S 方法时，报错！
原因：框架 Redis 类文件，没有设置密码。
解决：在__construct方法里添加代码：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">...
$options = array (
        '<span style="color: #AF87FF;">host</span>'          =&gt; C('<span style="color: #AF87FF;">REDIS_HOST</span>') ? C('<span style="color: #AF87FF;">REDIS_HOST</span>') : '<span style="color: #AF87FF;">127.0.0.1</span>',
        '<span style="color: #AF87FF;">port</span>'          =&gt; C('<span style="color: #AF87FF;">REDIS_PORT</span>') ? C('<span style="color: #AF87FF;">REDIS_PORT</span>') : 6379,
        '<span style="color: #AF87FF;">timeout</span>'       =&gt; C('<span style="color: #AF87FF;">DATA_CACHE_TIMEOUT</span>') ? C('<span style="color: #AF87FF;">DATA_CACHE_TIMEOUT</span>') : false,
        '<span style="color: #AF87FF;">password</span>' =&gt; C('<span style="color: #AF87FF;">REDIS_AUTH</span>')?:'', // &#28155;&#21152;&#27492;&#34892;&#20195;&#30721;
      '<span style="color: #AF87FF;">persistent</span>'    =&gt; false,
)<span style="color: #8B8878;">;</span>
...
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb0078d" class="outline-4">
<h4 id="orgdb0078d">配置 TP 3.2.3 Redis支持选择数据库功能</h4>
<div class="outline-text-4" id="text-orgdb0078d">
<p>
问题描述：官方默认不支持选择数据库功能，业务太多了，很不方便。
解决：修改__construct()方法
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">...
$options = array (
        '<span style="color: #AF87FF;">host</span>'          =&gt; C('<span style="color: #AF87FF;">REDIS_HOST</span>') ? C('<span style="color: #AF87FF;">REDIS_HOST</span>') : '<span style="color: #AF87FF;">127.0.0.1</span>',
        '<span style="color: #AF87FF;">port</span>'          =&gt; C('<span style="color: #AF87FF;">REDIS_PORT</span>') ? C('<span style="color: #AF87FF;">REDIS_PORT</span>') : 6379,
        '<span style="color: #AF87FF;">timeout</span>'       =&gt; C('<span style="color: #AF87FF;">DATA_CACHE_TIMEOUT</span>') ? C('<span style="color: #AF87FF;">DATA_CACHE_TIMEOUT</span>') : false,
        '<span style="color: #AF87FF;">password</span>' =&gt; C('<span style="color: #AF87FF;">REDIS_AUTH</span>')?:'',
      '<span style="color: #AF87FF;">persistent</span>'    =&gt; false,
      '<span style="color: #AF87FF;">dbindex</span>' =&gt; C('<span style="color: #AF87FF;">REDIS_DBINDEX</span>')?:C('<span style="color: #AF87FF;">REDIS_DBINDEX</span>')<span style="color: #FF1493;">:0</span>, // &#28155;&#21152;&#27492;&#34892;&#20195;&#30721;
)<span style="color: #8B8878;">;</span>
...
$this-&gt;handler-&gt;select($this-&gt;options['<span style="color: #AF87FF;">dbindex</span>'])<span style="color: #8B8878;">; </span><span style="color: #8B8878;">// &#28155;&#21152;&#27492;&#34892;&#20195;&#30721;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgace3cc9" class="outline-2">
<h2 id="orgace3cc9">问题记录</h2>
<div class="outline-text-2" id="text-orgace3cc9">
</div>
<div id="outline-container-org4532f9c" class="outline-3">
<h3 id="org4532f9c">问题1</h3>
<div class="outline-text-3" id="text-org4532f9c">
<p>
描述：Could not connect to Redis at 127.0.0.1:6379: Connection refused
原因：6379 没有断开，使用“exit”后
解决：重新使用redis-cli就可以
</p>
</div>
</div>
</div>
